In [1]:
import numpy as np
import pandas as pd

In [6]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [22]:
ser = pd.Series(np.arange(3.))
ser
# ser[-1]  # error

0    0.0
1    1.0
2    2.0
dtype: float64

In [20]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [30]:
# sort Series by index
obj = pd.Series(np.arange(4.), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1.0
b    2.0
c    3.0
d    0.0
dtype: float64

In [31]:
# sort Series by value
obj.sort_values()

d    0.0
a    1.0
b    2.0
c    3.0
dtype: float64

In [27]:
# sort DataFrame by any index
frame = pd.DataFrame(np.arange(8).reshape(2,4),
                        index=['three', 'one'],
                        columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [28]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [29]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [34]:
# sort DataFrame by value
frame.sort_values(by='a')

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [35]:
frame.sort_values(by=['a', 'b'])

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [36]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                   index=['a', 'b', 'c', 'd'],
                   columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [37]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [41]:
df.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [42]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [43]:
df.idxmax()

one    b
two    d
dtype: object

In [46]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [47]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [49]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [50]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object